---
kind: property
id: P:Autodesk.Revit.DB.Visual.WallPaint.WallpaintApplication
source: html/2059e405-36ae-a1be-70ad-1622d941d452.htm
---
# Autodesk.Revit.DB.Visual.WallPaint.WallpaintApplication Property

The property labeled "Application" from the "WallPaint" schema.

## Syntax (C#)
```csharp
public static string WallpaintApplication { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WallpaintApplicationType".